import 'package:kozarni_ecome/model/division.dart';

final List<Division> divisionList = [
  //Yangon Division
  Division(
    name: "ရန်ကုန်တိုင်း ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      '1000': [
        "ဒေါပုံ   ၁၀၀၀",
        "သံလျှင်   ၁၀၀၀",
        "သာကေတ   ၁၀၀၀",
      ],
      '2000': [
        "ရန်ကင်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပုဇွန်တောင်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တောင်ဥက္ကလာပ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သင်္ယန်းကျွန်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သုဝဏ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဗဟန်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တာမွေ(ကျောက်မြောင်း)  ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မင်္ဂလာတောင်ညွန့်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဗိုလ်တထောင်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပန်းဘဲတန်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောက်တံတား   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လသာ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လမ်းမတော်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကမာရွတ်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လှိုင်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အင်းစိန်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လှိုင်သာယာ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရွှေပြည်သာ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရွှေပေါက်ကံ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကြည့်မြင်တိုင်   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မရမ်းကုန်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အလုံ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "စမ်းချောင်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တောင်ဒဂုံ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြောက်ဒဂုံ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြောက်ဥက္ကလာပ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဒဂုံဆိပ်ကမ်း   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အရှေ့ဒဂုံ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မင်္ဂလာဒုံ   ၂၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ],

      '3500': [
        "ထောက်ကြန့်   ၃၅၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )"
      ],

      '4000': [
        "မှော်ဘီ   ၄၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောက်တန်း   ၄၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လှည်းကူး   ၄၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ]
    },
  ),
  //Mandalay Division
  Division(
    name: "မန္တလေးတိုင်း ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100": [
        "မန္တလေး ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောက်ပန်းတောင်း ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တံတားဦး ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပြင်ဦးလွင် ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြင်းခြံ ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရမည်းသင်း ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြစ်ငယ် ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပုလိပ် ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "စဉ့်ကိုင် ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောက်ဆည် ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဟန်မြင့်မိုဉ်လမ်းခွဲ ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဝမ်းတွင်း ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သဲတော ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပျော်ဘွယ် ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပုဂံ ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ညောင်ဦး ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပုပ္ပါး ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြစ်သား ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကူမဲ ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ]
    },
  ),

  //ပဲခူးတိုင်း
  Division(
    name: "ပဲခူးတိုင်း ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100": [
        "ပဲခူး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တောင်ငူ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကြို့ပင်ကောက်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "နတ်တလင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပြည် ၊ ဖြူး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရွှေတောင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပေါင်းတည်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဇီးကုန်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဒိုက်ဦး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ညောင်လေးပင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အင်းမ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပုတီးကုန်း ၊ သဲကုန်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရေတာရှည်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဆွာ ၊ သာဂရ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကေတုမတီမြို့သစ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောက်တံခါး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပဲနွယ်ကုန်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အုတ်တွင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တောကျွဲအင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရွှေကျင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သုံးဆယ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သာယာဝတီ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပြွန်တန်ဆာ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လက်ပံတန်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ]
    },
  ),
  //နေပြည်တော်
  Division(
    name: "နေပြည်တော် ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100":[
        "နေပြည်တော်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပျဉ်းမနား   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လယ်ဝေး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တပ်ကုန်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ]
    },
  ),

  Division(
    name: "မွန်ပြည်နယ် ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100":[
        "မော်လမြိုင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ချောင်းဆုံ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မုဒုံ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျိုက်ထို   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဘီးလင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သံဖြူဇရပ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရေး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဇင်းကျိုက်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပေါင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သထုံ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သုဝဏ္ဏဝတီ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",

      ],
    },
  ),


  //Ayarwadi Division
  Division(
    name: "ဧရာဝတီတိုင်း ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100": [
        "ပုသိမ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဟင်္သာတ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အသုတ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျုံပျော်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "လပွတ္တာ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဘိုကလေး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ငါးသိုင်းချောင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရေကြည်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မအူပင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြောင်းမြ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျိုက်လတ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောင်းကုန်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အိမ်မဲ ၊ ဖျာပုံ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကန်ကြီးဒေါင့်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဒါးက   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြန်အောင်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကြံခင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ]
    },
  ),

  Division(
    name: "စစ်ကိုင်းတိုင်း ( ၂ ရက် မှ ၇ ရက် အတွင်း )",
    townShipMap: {
      "3100":[
        "စစ်ကိုင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မုံရွာ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရွှေဘို   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရေဦး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ချောင်းဦး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အရာတော်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြင်းမူ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ],
      "4600": [
        "ကလေး   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
      ],

    },
  ),

  Division(
    name: "ကရင်ပြည်နယ် ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100":[
        "ဘားအံ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြိုင်ကလေး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြဝတီ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကော့ကရိတ်  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ],
    },
  ),

  Division(
    name: "မကွေးတိုင်း ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "3100":[
        "မကွေး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မင်းဘူး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ပခုက္ကူ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တောင်တွင်းကြီး   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ရေနံချောင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ချောက်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဆိပ်ဖြူ   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "မြို့သစ်   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "စလင်း   ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ],
    },
  ),


  Division(
    name: "ရှမ်းပြည်နယ် ( ၂ ရက် မှ ၇ ရက် အတွင်း )",
    townShipMap: {
      "3100": [
        "လားရှိုး  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "တောင်ကြီး  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အေးသာယာ  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကလော  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အောင်ပန်း  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "သီပေါ  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "နောင်ချို  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ကျောက်မဲ  ၃၁၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ],

      "4600": [
        "မူဆည်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ကွတ်ခိုင်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "တာချီလိတ်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ကျိုင်းတုံ   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
      ],
    },
  ),

  Division(
    name: "တနင်္သာရီတိုင်း ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
    townShipMap: {
      "4600":[
        "မြိတ် ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ကော့သောင်း  ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ထားဝယ်  ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "လောင်းလုံ ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "သရက်ချောင်း ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ရေဖြူ  ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "မောင်းမကန်  ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
      ],

    },
  ),

  Division(
    name: "ရခိုင်ပြည်နယ် ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
    townShipMap: {
      "4600": [
        "စစ်တွေ   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "သံတွဲ   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ကျောက်ဖြူ   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ပုဏားကျွန်း   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "မင်းပြား   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "မြောက်ဦး   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ပေါက်တော   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "တောင်ကုတ်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ငပလီ   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ကျောက်တော်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ဘူးသီးတောင်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "မောင်တော   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ရမ်းဗြဲကျွန်း   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
      ],
    },
  ),



  Division(
    name: "ကချင်ပြည်နယ် ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
    townShipMap: {
      "4600":[
        "မြစ်ကြီးနား   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "မိုးကောင်း  ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
        "ဗန်းမော်   ၄၆၀၀ ( ၃ ရက် မှ ၇ ရက်အတွင်း )",
      ],

    },
  ),

  Division(
    name: "ဂိတ်တင် ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
    townShipMap: {
      "1000":[
        "အောင်မင်္ဂလာ  ၁၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "ဒဂုံဧရာ  ၁၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
        "အောင်ဆန်းကွင်း ၁၀၀၀ ( ၂ ရက် မှ ၃ ရက် အတွင်း )",
      ],

    },
  ),

];
